meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "ПИКМИ": "Девочка которая хочет внимания и считает себя милашкой",
            "РОФЛ": "Какая-то шутка",
            "ЩИЩ": "одобрение или восторг",
            "КРИПОВЫЙ": "страшный, пугающий",
            "АГРИТЬСЯ": "злиться"
            }

print("Блок слов: КРИНЖ, ЛОЛ, ПИКМИ, РОФЛ, ЩИЩ, КРИПОВЫЙ, АГРИТЬСЯ")
word = input("Введите непонятное вам слово (большими буквами!): ")
if word in meme_dict.keys():
    print(meme_dict[word])
else:
    print("Такого слова пока нет!")
